Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: tm/5pice_ceshi-omegat.tmx
Source language: en_us
Languages: zh_cn

source: Also note that the 64bit SDK may not work, even if your OS is 64bit, so if in doubt you should choose the 32bit version.
zh_cn: 还需注意 64 位 SDK 可能也 无法工作，甚至如果你的系统是 64 位，所以尽可能选择 32 位版本。

source: Also, make sure all resources have different names (there is a function in the Scripts section of the main IDE that can check this for you), and do not name resources self, other, global, or all because these have special meaning in the language.
zh_cn: 其次，确认所有的资源名字不同（在IDE的 Scripts 菜单 有一个检测的功能“Check Resource Names”)，并且请 不要命名为 self、 other、 global，或者 all，它们在GML中特别的意义。

source: Also, the break is not required, and if there is no break statement the execution simply continues with the code for the next case statement.
zh_cn: 同样，“break”也不是必须的，没有它时，简单的继续到下一个case语句。

source: Also, the following unary operators exist:
zh_cn: 还存在以下一元运算符：

source: Although JPG images are supported, it is best to avoid using this file type as, due to the compression used, the images are generally of poorer quality than either PNG or BMP.
zh_cn: 尽管支持 JPG 格式，但尽量避免使用，因为这种格式的图像质量一般比 PNG 和 BMP 格式的图像低。

source: An EVENT is a special moment in which we can place certain actions and be sure that those actions will only happen when that EVENT is triggered.
zh_cn: 事件 是一个特殊的时刻，可以确保 动作 只在这些 事件 触发。

source: An Overview of Objects and Rooms
zh_cn: 物体和房间概述

source: An array or two can make it much easier to create a good menu system.
zh_cn: 一两个数组将很容易的建一个好的菜单系统。

source: An assignment simply stores a value in a variable and has the form:
zh_cn: 赋值语句把一个值赋予一个变量，其格式如下：

source: An expression can be a simple value but can also be more complicated, so, rather than assigning a value to a variable, one can also add a value to the current value of the variable using +=, for example:
zh_cn: 其中，表达式（expression）可以是一个值，也可以是复杂的代数式，除了将一个值赋给一个变量，还可以使用 “+=”在变量存储的值上加一个值，比如：

source: An instance is a copy of the base object, complete with all the same events and actions, and it's these that are used in your games.
zh_cn: 实例是物体用于你的游戏中拥有完全相同的事件和动作的副本。

source: An introduction to GameMaker: Studio.
zh_cn: GameMaker: Studio简介。

source: And the actual finished animation would look like this when placed in a game:
zh_cn: 在游戏里看起来就像这样:

source: And the script should now look like this:
zh_cn: 脚本这样写：

source: Android test target for testing your project on Android devices before buying the appropriate target module
zh_cn: 测试开发安卓游戏需要购买安卓模块

source: Another example of an event is the Collision Event.
zh_cn: 另一个例子是 Collision Event (碰撞事件)。

source: Another thing that is necessary is a copy of Microsoft Visual Studio which can be found here.
zh_cn: 另一件事是需要一份 Microsoft Visual Studio 的拷贝，可以在 这里 找到。

source: Another thing you can do with surfaces is use them as textures to be manipulated, or to create sprites "on the fly", or to create complex overlays.
zh_cn: 另外就是使用表面作为需要操作的纹理贴图，或者创建“在飞”的精灵，或者创建复杂的叠加。

source: Another way to look at a parent object is as a way to "group" objects together under the same umbrella and have them share certain things without losing their own identity.
zh_cn: 从另一个角度来看父对就是 "group (组)"，分享某些事情而又不失去自己的身份。

source: Any computer that is less than five years old should be able to run GameMaker: Studio without any problems, but here are the minimum specs for your PC to use the program, and then the necessary specs for each of the additional modules that you may have.
zh_cn: 任何年龄小于5年的电脑运行 GameMaker: Studio 都没有问题，但是您需要足够的空间安装本软件以及其他的模块。

source: Any of those will bring up the following window: To load a sound, press the Load Sound button to the right of the sound name.
zh_cn: 无论以哪种方式都将打开下面的窗口:按下声音名称右边的 Load Sound 按钮。

source: Any other negative number means a synchronisation failure
zh_cn: 负数意味着同步失败。

source: Apart from that you will also need the following:
zh_cn: 此外你还需要:

source: Apart from these buttons and input boxes, you also have two further options there especially useful.
zh_cn: 除了这些按钮和输入框外，你还有两个特别有用的选项可供选择。

source: Apart from these compile targets each available version is different and has a number of limits and restrictions which are detailed below.
zh_cn: 每个版本除了编译目标不同，还有一些限制，详细说明如下。

source: Apart from these drop down menus, you also have a series of buttons along the top with which you can control certain aspects of your game and the Debug Modules interaction with it.
zh_cn: 除了这些下拉菜单，窗口上你还有一排按钮来控制你游戏中的方方面面，让游戏与调试模块产生互动。

source: Application Surface
zh_cn: 应用表面层

source: Argument
zh_cn: 参数

source: Arithmetical
zh_cn: 算术运算

source: Array Functions
zh_cn: 数组函数

source: Arrays
zh_cn: 数组

source: Arrays are essential for making RPGs, because instead of having a jumble of variables, you just have a few lines, which you can refer back to at any time.
zh_cn: 制作RPG游戏时数据是基础的用法，仅需数行，替代使用混乱的变量，并且可以随时可以重新提及。

source: Arrays may seem confusing at first, but they can be extremely useful and are an essential part of making games.
zh_cn: 一开始看到数组可能会混乱，但却是极有用并且是制作游戏时非常基础的部分。

source: As a small example, consider the following code which will move the instance towards the position x=200 in the room:
zh_cn: 作为一个小例子，想一想下面的代码，哪一块将移动实例朝着x=200移动：

source: As above, only now the menu button is at the top.
zh_cn: 同上，只有菜单在顶部。

source: As above, only now the menu button is on the left.
zh_cn: 如上，只有菜单按钮在左边。

source: As an example, consider the following code.
zh_cn: 例如，考虑下面的代码。

source: As before, each number points to a position within the array, only this time each position has an "a" and "b" coordinate.
zh_cn: 之前每个数值对应数组的一个位置，但这次一个位置有“a” 和 “b”两个坐标。

source: As long as the expression is true, the statement (which can also be a code block) is executed.
zh_cn: 只要表达式（expression）是true，这些语句（statement）（也可以是语句块）就会被反复执行。

source: As mentioned above, all normal drawing in your game is done on the application surface, and this surface can be changed and manipulated just like a normal surface.
zh_cn: 正如上面提过的，所有普通绘制都是在应用表面层里进行的，这个表面可以像通常的表面层一样改变或控制。

source: As mentioned above, you can pass a number of arguments to a script, and it will use these to perform the task you have written it for.
zh_cn: 入上文提到的那样，你可以传递数个参数给脚本，脚本会利用这些参数执行你写下的功能。

source: As mentioned previously, you need to assign images (sprites) and other things to objects, which are easily defined in your game through the DnD action icons to give them properties and behaviour, after which you place them in rooms along with backgrounds and other things to give your game the look and feel you want.
zh_cn: 如上图，您需要为物体设计图像 (精灵) 和其他东西，并且通过 DnD 动作图标简单地给它们定义属性和行为，然后将它们和背景以及其他东西放在房间里使得您的游戏看起来像是您想要的那样。

source: As such, a sprite is either a single image, drawn with any drawing program you like, or a set of images that, when played one after another, looks like a looping animation.
zh_cn: 因此精灵是用任意软件绘制的一张图像或一组图像，播放时一个接一个，像是循环动画。

source: As the name implies, this window will show all instance variables, local variables and built in variables associated with the instance currently being stepped through in the Source window (if an instance is being referenced using the keyword "other" or the with statement, then this window will show that instances properties instead).
zh_cn: 顾名思义，这个窗口会显示所有实例变量，局部变量和与当前源代码窗口中按步跳过的实例的内置变量。（如果一个实例是用关键词“other”或者with语句引用来的，那么这个窗口中会显示该实例的属性）。

source: As there are a number of them and each has its own selection of options, you can find out more about them from the pages listed below:
zh_cn: 很多人有自己的设置选项。你可以在下面的列表中找到详细信息:

source: As values in all expressions you can use numbers, variables, or functions that return a value, and sub-expressions can be placed between brackets too.
zh_cn: 表达式的值可以使用数字、变量，或者有返回值的函数，子表达式放在括号里面。

source: As with all resources in GameMaker: Studio you should give your new path a unique name as this is what will be used to identify it throughout the game you are making, and a good system that a lot of people use is to prefix (or suffix) the resource for easy recognition in code or actions (eg: path_Enemy_1 or PowerUp_path).
zh_cn: 就和 GameMaker: Studio 里的其它资源一样，每个路径资源你都需要指定一个独一无二的名称 ，因为在接下来的过程中你需要用这个名称来识别这个资源，并且在一个好的系统中人们通常使用前缀（或者后缀）来区别不同类型的资源（如 path_Enemy_1 或者 PowerUp_path），这样在代码或者动作中才好区分这些资源。

source: As with the Demos, these are pulled from an RSS feed, so you will need an active internet connection to access them.
zh_cn: 和演示一样，来自于RSS feed的推送，所以你需要联网来访问它们。

source: As you can probably see, the top left of the window has a field for the "Name" of the sprite.
zh_cn: 你可以看到，窗口的左上方有精灵的名字。

source: As you can see, objects are the most important ingredients of games made with GameMaker: Studio, so let us talk a bit more about them.
zh_cn: 正如你看到的，物体是 GameMaker: Studio 中最重要的组成部分，所以让我们来看看更多的细节。

source: As you can see, we haven't used any numbers in the actual array, rather a variable to count down through the values.
zh_cn: 我们并没有用具体数字来标注数据的位置，而是使用了一个变量count。

source: As you would expect, you can (and should always) give your object a name.
zh_cn: 正如你期望的，你可以 (并且必须) 给你的物体命名。

source: Assign a surface to a view.
zh_cn: 给视野指定一个视野。

source: Assigning
zh_cn: 赋值运算符

source: Assigning A Path To An Object
zh_cn: 在物体上绑定一个路径

source: Assignments
zh_cn: 赋值

source: Assume you want to make a guard and that this guard should move 20 time steps to the left, then 10 upwards, then 20 to the right, then 10 downwards and then finally stop.
zh_cn: 假设你想做一个守卫，这个守卫需要向左走20时间步（step），然后向上走10步，然后再向右走20步，最后向下走10步回到原点结束。

source: Asynchronous
zh_cn: 异步设计

source: At all other times, "other" will simply show the same data as "Self".
zh_cn: 除此之外的其他时间，“other”仅会显示与“self”相同的数据。

source: At first glance this may seem rather confusing, but the window is split into sections and we shall cover each one individually so you can get an overview of what they are for.
zh_cn: 一开始看到这个界面可能会迷茫，我们会讲解一下这个界面的概述。

source: At least 1280 x 1024 screen resolution
zh_cn: 至少 1280 x 1024 的屏幕分辨率

source: At least 2 GB of RAM memory
zh_cn: 至少 2G 内存

source: At least 3 GB of free disk space
zh_cn: 至少 3G 磁盘空间

source: At some point while creating your games you will need one of your objects to follow a path through a level.
zh_cn: 有些时候你的游戏中需要让一些物体按照特定路径移动穿过整个关卡。

source: At the bottom you have a list of previously opened files.
zh_cn: 下面有最近工程列表。

source: At the left of the main form you find the resource tree.
zh_cn: 在主窗口的左边可以找到资源树。

source: At the top of the general start-up screen you can see that there are nine tabs: Welcome (always the initial start-up screen), Open, New, Import, Release Notes, Demos, Tutorials, News and Licences.
zh_cn: 在标准的启动界面顶部，可以看到九个标签: Welcome (欢迎，总是初始显示界面), Open (打开), New (新建), Import (导入), Release Notes (更新日志), Demos (演示), Tutorials (教程), News (新闻) 和 Licences (许可)。

source: At the top of the path editor you can find the tool bar which has a number of buttons that refer to actions in the path editor:
zh_cn: 在窗口顶端的是路径工具栏，上面有数个不同功能的按钮：

source: At the top of the window there is the menu and a handy toolbar to access some of the most used commands when creating a game.
zh_cn: 在窗口顶部有菜单和工具栏用来方便地访问一些最常用的指令。

source: At the top you have four drop down menus:
zh_cn: 在顶端有四个下拉菜单：

source: At the very top of the GUI you will find the drop down menus.
zh_cn: GUI 的顶部会发现下拉菜单。

source: At the very top of the GUI you will find the drop-down menus.
zh_cn: 在GUI的顶部可以发现主菜单。

source: Audio Groups
zh_cn: 音频组

source: BUT this will not be the case, since we did not return the array from the script, so all we changed was the temporary copy that was created when we passed the array as an argument into the script.
zh_cn: 但并不是这种情况，既然我们没有从脚本中返回数组，所有改变都只是数组作为参数传递给脚本时创建的临时副本，而不是参数中的数组。

source: Back: Advanced Use Index
zh_cn: 返回: 高级使用

source: Back: Contents
zh_cn: 返回: 介绍

source: Back: DS Grids
zh_cn: 上一页： 数据结构

source: Back: GML Overview
zh_cn: 返回: GML 概述

source: Back: Maths
zh_cn: 上一页: 数学

source: Back: Push Notifications
zh_cn: 返回：Push Notifications

source: Back: Reference
zh_cn: 返回: GML参考

source: Back: Steam Workshop
zh_cn: 返回: Steam 创意工坊

source: Back: Surfaces
zh_cn: 返回: 表面层

source: Back: The Drop Down Menus
zh_cn: 返回: 下拉菜单

source: Back: The Game Window
zh_cn: 返回: 游戏窗口

source: Back: The Graphical User Interface (GUI)
zh_cn: 返回: 用户图形界面 (GUI)

source: Back: Using GameMaker: Studio
zh_cn: 返回： 使用 GameMaker: Studio

source: Back: Vector Functions
zh_cn: 上一页: 向量函数

source: Back: Views
zh_cn: 返回: Views

source: Back: Windows And Views
zh_cn: 返回: 窗口和视野

source: Back: Windows and Views
zh_cn: 返回: Windows and Views

source: Backgrounds
zh_cn: 背景

source: Backgrounds are another of the basic resources that you can use in GameMaker: Studio.
zh_cn: 背景是 GameMaker: Studio 中另一个基础资源。

source: Backgrounds as Tiles
zh_cn: 背景作为磁贴

source: Backgrounds can actually be made to do a lot of things but for the time being, just consider it as something that makes the rooms look nice.
zh_cn: 背景事实上可以做很多事，但是事实上还是作为让房间更好看的东西比较稳妥。

source: Basic Requirements
zh_cn: 基本需求

source: Be very careful with this as it cannot be undone.
zh_cn: 特别 注意此动作无法撤销。

source: Be aware too that there are many aspects to making games that are all equally important: game-play, graphics, sounds, user interaction, etc... but, the most important aspect of all, is patience.
zh_cn: 要知道，制作游戏有很多同样重要的事情：游戏性、画面、声音、用户交互等等，但是，最重要的是您需要有 耐心。

source: Be careful with using large backgrounds, especially if your target device is HTML5 or one of the smaller mobile devices, as large backgrounds need more memory and this could be a problem later when you try to compile your game.
zh_cn: 谨慎使用大背景，特别是如果你想制作HTML5或较小的设备的时候，大背景会需要更多的内存，当你编译游戏的时候可能会出现问题。

source: Be careful with your do loops, as you can easily make them loop forever, in which case your game will hang and not react to any user input anymore.
zh_cn: 注意这是一个循环，可能会出现死循环，游戏将会挂起不响应输入。

source: Before delving into the possibilities of GameMaker: Studio it is good to get a feeling for the idea behind the program.
zh_cn: 在尽可能深入 GameMaker: Studio 之前最好找到一种感觉。

source: Below depth there is the option to make an object persistent.
zh_cn: 深度的上面是持续性设置。

source: Below is an example of its use in a "for" loop:
zh_cn: 下面是“for”循环中的一个例子：

source: Below the "Name" section are the buttons that enable you to load, save or edit a background image.
zh_cn: 名字下面的部分是加载、保存和编辑背景图片。

source: Below you can find an example of a typical way to use "do... until":
zh_cn: 下面是“do... until”的一个经典例子：

source: Below you can find an example of a typical way to use "while":
zh_cn: 下文你能找到一个典型使用“while”的方式的一个范例：

source: Below you can see a few examples of how this can be used, and its syntax is simply:
zh_cn: 下面可以看到一些用法的例子，语法挺简单的：

source: Beneath the Add button you have Insert and Delete buttons too.
zh_cn: 在 Add 按钮下方的是 Insert 和 Delete 按钮。

source: Beneath the file name there are also a series of options for the target platform that this included file should be copied to.
zh_cn: 在文件名下方还有一系列选项用来设置这个文件需要被包含进哪些目标平台的程序中。

source: Beneath the resource tree on the left of the main GameMaker: Studio IDE you have the Game Information.
zh_cn: 在 GameMaker: Studio 左侧的资源树里有一个 Game Information。

source: Beneath the tabs, there is a section with hints, tips and offers related to GameMaker: Studio, which you can scroll through using the arrow icons on either side, and beneath that you will see listed any projects that you have previously opened so that you can quickly get back to work where you left off previously.
zh_cn: 在标签的下方，有部分有关 GameMaker: Studio,的提示、技巧，你可以通过两边的箭头滚动，再下方，则是列出之前打开过的工程使得你可以快速回到之前离开的工程。

source: Beside the quality bar for all file types, you can set the maximum volume for a sound, ie: if the slider is at 0.5 then the max volume for that sound when the gain is 1, will be half the recorded volume for the sound.
zh_cn: 在品质的旁边，可以设置声音最大音量，即:如果滑块是 0.5，那么播放时就只有一半的声音。

source: Beware, as this will not warn you that the path has changed, as clicking the close button would do, but will just save directly any changes you have made.
zh_cn: 注意点击这个按钮会导致路径直接被保存，并不会提示你任何关于路径是否被修改。而如果你点击关闭按钮，编辑器会提示你路径是否被修改过。

source: Bitwise
zh_cn: 位运算符

source: Both grids must have been created previously using the ds_grid_create function.
zh_cn: 两个栅格必须都已经通过函数 ds_grid_create 被创建。

source: Breakpoints
zh_cn: Breakpoints（断点）

source: Breakpoints set from the IDE are saved along with your game and persist over various runs, however if you add a breakpoint to your code in the Debug Module, this will be lost after the module is closed, or a new test run started.
zh_cn: 在IDE中设置的断点会一直随着你的游戏而存在，即使多次运行也会留存。然而如果是你在调试模块中添加的断点的话，一旦关闭调试模块或者重开测试运行，断点就会消失了。

source: Buffer
zh_cn: Buffer（缓冲器）

source: Buffers
zh_cn: 缓存区

source: But how do you create a room?
zh_cn: 但是如何创建房间？

source: But that's not all!
zh_cn: 但这并不是全部！

source: But what if we want to initialize the array with different values for each position?
zh_cn: 但如果我们想给不同的位置赋予不同的值该怎么做？

source: But what many people don't realise is that it is actually more fun to design your own computer games and let other people play them!
zh_cn: 但是许多人不知道的是，设计你自己的电脑游戏，让其他人玩实际上更 有趣！

source: But, in the Editor Preferences, you can indicate external editors that you want to use for editing sounds.
zh_cn: 但是在 Editor Preferences (编辑器配置) 你可以选择你想使用的外部编辑器。

source: Buying Additional Modules From Steam
zh_cn: 从 Steam 购买附加模块

source: By changing this value you can change the amount of a room that you can see through the view, but bear in mind that this does not change the view port so setting a view height larger than the view port height will result in the view being scaled down to fit the port, just as a view height smaller than the port height will scale the view up to fit.
zh_cn: 改变这个值，可以更改通过视野能看见的房间的范围，但是记住这 不会 改变 视口，所以设置了一个比视口高度更大的值将导致视野缩小以适应视口，而比视口更小时将放大以适应视口。h

source: By changing this value you can change the amount of a room that you can see through the view, but bear in mind that this does not change the view port so setting a view width larger than the view port width will result in the view being scaled down to fit the port, just as a view width smaller than the port width will scale the view up to fit.
zh_cn: 改变这个值，可以更改通过视野能看见的房间的范围，但是记住这 不会 改变 视口，所以设置了一个比视口宽度更大的值将导致视野缩小以适应视口，而比视口更小时将放大以适应视口。

source: By changing this value you can set the view to a new position, with (0,0) being the upper left corner of the room, or you can reference this variable to ensure that an instance is always drawn at a relative position to the view (see example code below).
zh_cn: 通过改变这个值可以设置视野至一个新的位置，使用(0,0) 将是房间的左上角，或者参数此变量以确保实例允许绘制在视野以内（查看下面例子中的代码）。

source: By checking solid you are indicating to GameMaker: Studio that it should consider instances of this object to be a solid object (like a wall).
zh_cn: GameMaker: Studio 里对固体物体的碰撞处理不同于非固体，

source: By clicking on the - sign these disappear again (collapse it).
zh_cn: 通过点击 - 可以收缩已经展开的资源树。

source: By clicking this you can open the Configurations Window which permits you to add, remove and rename configurations.
zh_cn: 通过点击这个按钮你可以打开配置窗口使得你可以添加移除或重名民配置。

source: By default the application surface is enabled and all drawing for the Draw events will be done to that and the surface drawn to the screen.
zh_cn: 默认是启用应用表面层，所有绘制事件中的绘制将会在应用表面层中结束，然后将这个表面层绘制到屏幕上。

source: By default this is enabled, but in many cases you will want to take over when and how the surface is drawn (when using shaders for example), in which case you would use this function to set it to false so that you can draw it yourself when and how you require.
zh_cn: 默认是允许，但是也有许多需要接管何时及怎样进行表面绘制的情况 (比如使用着色器的时候)，这里你可以用这个函数设置为假，自主决定绘制的时间和方式。

source: By default, the GUI layer is 1:1 with the application surface resolution and drawn at the (0,0) position of the surface too.
zh_cn: 默认情况下，GUI层与应用表面层分辨率比例是1:1，绘制位置也是在表面层的(0,0)。

source: By one level, we mean that only the last action performed will be undone.
zh_cn: 一次操作的含义是只有最后一次的改动会被撤销。

source: By using this command you create a stand-alone version of your game.
zh_cn: 使用这个命令可以创建独立游戏。

source: Call Stack
zh_cn: Call Stack（调用栈）

source: Card Games.
zh_cn: 卡牌游戏（Card Games）。

source: Care should be taken when setting this value, as setting it too low can result in the instance moving faster than the view can and so it may disappear out one side of the view until it stops and the view catches it again.
zh_cn: 谨慎设置此值，因为设置过低将导致实例比视野移动更快，然后消失在视野外面，直至停下后才再次跟上。

source: Centers the region based on the viewable or browser area.
zh_cn: 在可视范围或浏览器上将一个区域居中放置。

source: Changing this will change the encoding that is used and therefore reduce (or improve) the final quality of the sound.
zh_cn: 这将会改变所使用的编码，从而减少 (或提高) 声音的最终品质。

source: Clears the entire screen with an alpha-blended given colour.
zh_cn: 用指定透明度的指定颜色填充整个屏幕。

source: Clears the entire screen with colour.
zh_cn: 用指定颜色填充整个屏幕。

source: Clears the grid with the given id to an indicated value.
zh_cn: 将一个被给定id的栅格用一个指定的值清空。

source: Click on this to expand them again.
zh_cn: 单击该按钮展开它们。

source: Clicking Create will then create and save the initial project files.
zh_cn: 点击 Create 就可以创建并保存项目文件了。

source: Clicking on this will bring up a rich text editor as shown in the following image: The game information is basically a scratch pad for you, where you can draught out ideas, to-do lists, contact details and any other information that you may need at a later date or that you don't want to forget.
zh_cn: 点击它将打开一个如下图所示的 rich text (富文本) 编辑器: 游戏信息基本上是你的草稿，你可以填写任何东西。

source: Cloud Services
zh_cn: 云服务

source: Code
zh_cn: 代码

source: Collisions with instances of solid objects are treated differently from collisions with non-solid objects and as such you are strongly advised to use Solid only for objects that are not moving.
zh_cn: 所以，尽量只把墙这种不能动的物体设置为 固体。

source: Combining
zh_cn: 逻辑运算符

source: Comments in Code
zh_cn: 代码注释

source: Comparing
zh_cn: 比较运算符

source: Compression
zh_cn: 压缩

source: Configurations
zh_cn: 配置

source: Configurations for specific clients or builds
zh_cn: 为特殊的客户端或输出配置你的产品

source: Constant
zh_cn: 常量

source: Constants
zh_cn: 常量

source: Contents
zh_cn: 内容

source: Conversely If you want to make sure it lies below other instances then you have to give it a positive (high) depth.
zh_cn: 如果你想保证物体位于顶端请给它最小值。相反，如果想让它位于底部给它最大值即可。

source: Copies a source surface into a destination surface.
zh_cn: 复制一个源表面层到目的表面层。

source: Copies one grid into another grid.
zh_cn: 将一个栅格复制给另一个。

source: Copies part of a source surface onto a destination surface (without any form of blending.)
zh_cn: 复制源表面图层的一部分到目标表面图层 (没有任何形式的混合)。

source: Create an invisible controller object, create a time line that at certain moments creates enemies, and then assign it to the controller object.
zh_cn: 创建一个看不到的控制器物体，绑定一个在特定时间点创建敌人的时间轴。

source: Creates a surface and links it to an HTML5 canvas element.
zh_cn: 创建一个表面层，并将其链接到HTML5的画布(canvas)元素上。

source: Creates a surface.
zh_cn: 创建一个表面层。

source: Creating A Timeline
zh_cn: 创建一个时间轴

source: Creating Rooms
zh_cn: 创建房间

source: Creating Your First Project
zh_cn: 创建你的第一个工程

source: Creating Your Stand Alone Game
zh_cn: 创建你的独立游戏

source: Creating games for the Windows Phone module requires that you have installed the Windows Phone SDK 8.0 (download from here).
zh_cn: 创建 Windows Phone 模块游戏需要安装Windows Phone SDK 8.0 (点击 这里 下载)。

source: Creating stand-alone applications is very easy with GameMaker: Studio.
zh_cn: 使用 GameMaker: Studio 创建独立游戏十分简单。

source: DHCP, so the virtual machine can get a IP address on the local network
zh_cn: •DHCP，使得虚拟机可以获得本地IP地址

source: Data Structures
zh_cn: 数据结构

source: Data Types
zh_cn: 数据类型

source: Date and Time
zh_cn: 日期和时间

source: Debugging
zh_cn: 调试

source: Defining Objects
zh_cn: 定义物体

source: Defining paths
zh_cn: 定义路径

source: Demos are different to tutorials in that they focus on explaining just one function or concept rather than giving a general overview, and as such it is recommended that you have a working knowledge of GameMaker: Studio and GML before opening these.
zh_cn: 不同的演示都是解释一个功能或概念，而不是概述。因此建议你有 GameMaker: Studio 和 GML 基础再来看这些演示。

source: Depending on the type of resource selected, some of the commands may not be visible.
zh_cn: 一些命令可能不可见。

source: Depth
zh_cn: 深度
